[
  {
    "id": "10.1177/22808000261421276",
    "title": "Graphene oxide-reinforced thermosensitive hydrogel co-delivering paclitaxel and dexamethasone for restenosis prevention.",
    "journal": "Journal of applied biomaterials & functional materials",
    "authors": "Sheng, Jiang, Wang",
    "abstract": "Restenosis remains a significant limitation of vascular intervention procedures, primarily driven by the proliferation and inflammation of human-derived vascular smooth muscle cells (hVSMCs). This study developed a thermosensitive chitosan/β-glycerophosphate (CS-β-GP) hydrogel reinforced with graphene oxide (GO) for the localized co-delivery of paclitaxel (PTX) and dexamethasone (DEX). The incorporation of GO increased the storage modulus from approximately 3.95 kPa to 6.96 kPa, enhancing mechanical strength and accelerating gelation near body temperature (~36°C-37°C). SEM analysis revealed a porous, interconnected structure that supports drug delivery, while swelling was moderate (~145% at 6 h) and degradation resistance was improved, with the hydrogel retaining 80% of its mass in PBS after 30 days. Drug loading favored PTX (70% at 60 μg/mL) over DEX (17%) with sustained release profiles. Biologically, the dual-drug hydrogel (CS-β-GP-GO@PTX-DEX) selectively reduced hVSMC viability, migration, proliferation (~30%, ~20%, and ~30%, respectively), while preserving endothelial cell viability (~60%) and lowering proinflammatory cytokines (IL-1β ~100 pg/mL, IL-6 ~110 pg/mL, TNF-α ~70 pg/mL). These findings establish the CS-β-GP-GO@PTX-DEX hydrogel as a mechanically robust, selective, and effective platform for preventing restenosis and enhancing vascular tissue regeneration.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41689645/",
    "date": "2026-02-15",
    "analysis": "{\n    \"chinese_summary\": \"本研究开发了一种基于氧化石墨烯增强的温敏性壳聚糖/β-甘油磷酸酯水凝胶，用于局部共递送紫杉醇和地塞米松。该水凝胶机械强度提升，在体温附近快速凝胶化，具有多孔结构，能持续释放药物。生物实验表明，双药水凝胶能选择性抑制血管平滑肌细胞的活性、迁移和增殖，同时保护内皮细胞并降低促炎细胞因子水平，为预防血管再狭窄提供了有效平台。\",\n    \"innovation\": \"首次将氧化石墨烯增强的温敏性壳聚糖/β-甘油磷酸酯水凝胶与紫杉醇、地塞米松双药共递送系统结合，实现了对血管平滑肌细胞的选择性抑制和抗炎协同作用。\",\n    \"flaw\": \"研究未在动物模型中进行体内验证，缺乏长期安全性和临床转化潜力的评估。\"\n}"
  },
  {
    "id": "10.1177/09636897251409464",
    "title": "Collagen-hyaluronic acid hydrogel with embedded chondrocytes as a platform for modeling early stages of endochondral ossification <i>in vitro</i>.",
    "journal": "Cell transplantation",
    "authors": "Malić, Doubková, Pražák",
    "abstract": "Tissue engineering strategies aim to create bone models to enhance our understanding of bone development and improve bone repair. Endochondral ossification (EO), where cartilage is replaced by bone, is difficult to replicate. We developed a collagen-hyaluronic acid (HA) hydrogel system for a three-dimensional (3D) co-cultivation of human chondrocytes, human mesenchymal stem cell (hMSCs), and human umbilical vein endothelial cells (HUVECs) to model the early stages of EO. To our knowledge, this specific tri-culture configuration within such a hydrogel composition has not been previously reported, providing a novel platform for studying EO-related cellular and matrix interactions <i>in vitro.</i> Differentiation and migration of hMSCs and HUVECs were studied in collagen I (Col I) hydrogels, with or without the addition of collagen II (Col II), HA, and chondrocytes. Col II and HA enhanced cell osteogenic differentiation, as documented by an increased <i>COL1A1</i> and <i>ALPL</i> gene expression and enhanced alkaline phosphatase activity. Chondrocytes further promoted osteogenic cell differentiation and temporarily enhanced hypertrophic and angiogenic signaling as evidenced by elevated <i>MMP13</i> and <i>VEGFA</i> expression. Furthermore, elevated <i>SOX9</i> expression and Alcian blue staining indicated a chondrogenic-supportive environment. These findings highlight the synergistic effects of osteogenic and chondrogenic signals, emphasizing the potential of combining Col I and Col II, HA, and essential cell types in hydrogels to optimize bone and cartilage tissue engineering.",
    "score": 30,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41688374/",
    "date": "2026-02-15",
    "analysis": "{\n    \"chinese_summary\": \"本研究开发了一种胶原-透明质酸水凝胶系统，用于三维共培养人软骨细胞、人间充质干细胞和人脐静脉内皮细胞，以模拟早期软骨内成骨过程。研究发现，胶原II和透明质酸能增强细胞成骨分化，软骨细胞进一步促进成骨分化并暂时增强肥大和血管生成信号，突出了成骨和软骨信号在优化骨软骨组织工程中的协同作用。\",\n    \"innovation\": \"首次报道了在胶原-透明质酸水凝胶中构建人软骨细胞、人间充质干细胞和人脐静脉内皮细胞的三维共培养体系，为体外研究软骨内成骨相关的细胞与基质相互作用提供了新平台。\",\n    \"flaw\": \"研究主要关注早期软骨内成骨阶段，未验证该体系在完整骨组织形成或体内修复应用中的长期效果。\"\n}"
  },
  {
    "id": "10.1002/mabi.202500553",
    "title": "Recent Advances in Integrating Graphene into Polymeric Nanocomposite Hydrogels for Biomedical Applications.",
    "journal": "Macromolecular bioscience",
    "authors": "Hussain, Batool, Shahzad",
    "abstract": "Hydrogels are widely used in biomedical applications because they are biocompatible, respond to external stimuli, and closely mimic the mechanical properties of natural tissues. However, conventional hydrogels often exhibit poor electrical conductivity, low mechanical strength, and limited functionality, hindering their use in advanced biomedical platforms. These challenges can be addressed by integrating 2D graphene and its derivatives into polymer-based nanocomposite hydrogels (CHGs). Graphene-enhanced CHGs offer superior mechanical strength, electrical conductivity, thermal stability, and optical properties, making them ideal for advanced biomedical applications. This review provides a comprehensive analysis of graphene's structural and functional properties and its incorporation into hydrogel matrices for CHG synthesis. It explores recent advancements in graphene-based CHGs for drug delivery, tissue engineering, and photothermal therapy (PTT), highlighting their enhanced performance. Additionally, it examines the emerging role of machine learning (ML) in optimizing CHG properties, such as predictive modeling for wearable sensors in biomedical contexts. By bridging materials science and computational intelligence, this review outlines a roadmap for designing next-generation smart hydrogels, emphasizing their transformative potential in addressing complex healthcare challenges.",
    "score": 15,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41685914/",
    "date": "2026-02-14",
    "analysis": "{\n    \"chinese_summary\": \"水凝胶因其生物相容性、对外部刺激的响应性及与天然组织相似的机械性能，广泛应用于生物医学领域。然而，传统水凝胶存在导电性差、机械强度低和功能有限等问题，限制了其在先进生物医学平台中的应用。通过将二维石墨烯及其衍生物整合到聚合物基纳米复合水凝胶中，可以解决这些挑战。石墨烯增强的复合水凝胶具有优异的机械强度、导电性、热稳定性和光学性能，适用于药物递送、组织工程和光热疗法等先进应用。本综述分析了石墨烯的结构与功能特性及其在水凝胶基质中的整合，探讨了机器学习在优化水凝胶性能中的作用，并展望了智能水凝胶在解决复杂医疗问题中的潜力。\",\n    \"innovation\": \"通过整合二维石墨烯及其衍生物到聚合物基纳米复合水凝胶中，显著提升了水凝胶的机械强度、导电性和多功能性，并引入机器学习优化其性能，推动了智能水凝胶在生物医学领域的创新应用。\",\n    \"flaw\": \"尽管石墨烯增强的复合水凝胶性能优越，但其生物安全性、长期稳定性和大规模制备工艺仍需进一步研究和验证。\"\n}"
  },
  {
    "id": "10.1111/1750-3841.70914",
    "title": "Encapsulation of Pediococcus acidilactici in Sodium Alginate-Calcium Lactate-Skim Milk Gel Beads: Characterization and Simulated Digestion Analysis.",
    "journal": "Journal of food science",
    "authors": "Bai, Zheng, Qiu",
    "abstract": "This study aimed to develop a composite hydrogel matrix of sodium alginate (SA) and skim milk for encapsulating Pediococcus acidilactici CCFM18 and exploring the synergy of these components on protecting the activity and stability of P. acidilactici CCFM18. The synthesis process was optimized using response surface methodology, yielding optimal conditions: calcium lactate (CL) concentration of 4.18% (w/v), curing time of 47 min, and curing temperature of 41°C. The resulting gel beads achieved an encapsulation efficiency of 72.14%, featuring a spherical structure with abundant internal voids. The formation of SA-CL-skim milk gel beads involved cross-linking and hydrogen bonding between the carboxyl groups of SA, Ca<sup>2+</sup>, and the carboxyl groups/hydroxyl groups of proteins, significantly modifying functional group distributions, x-ray diffraction patterns, rheological behavior, and thermodynamic properties. In vitro simulated digestion analysis revealed that the gel beads effectively protected bacteria from gastric acidity and successfully delivered them to the intestinal environment, achieving a release rate of 84.19% with a viable cell count of 4.9 × 10<sup>7</sup> CFU, which was 8-fold higher than that of unencapsulated bacteria. These findings highlighted the potential of SA-CL-skim milk gel beads in protecting P. acidilactici activity and achieving targeted release.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41684286/",
    "date": "2026-02-14",
    "analysis": "{\n    \"chinese_summary\": \"本研究开发了海藻酸钠-乳酸钙-脱脂乳复合水凝胶微球用于包封Pediococcus acidilactici CCFM18。通过响应面法优化合成条件，包封率达72.14%。微球通过交联和氢键作用形成，能有效保护细菌通过胃酸环境并在肠道靶向释放，活菌释放量比未包封组提高8倍。\",\n    \"innovation\": \"首次将海藻酸钠、乳酸钙和脱脂乳协同构建复合水凝胶体系，通过多重分子相互作用显著提升益生菌在胃肠环境中的保护效率和靶向释放性能。\",\n    \"flaw\": \"研究仅进行了体外模拟消化实验，缺乏动物或人体试验验证其在实际生物体内的保护效果和安全性。\"\n}"
  },
  {
    "id": "10.1016/j.carbpol.2026.124965",
    "title": "Cellulose nanofibers reinforced biomimetic hydrogel featuring orthogonal anisotropic architecture for guiding BMSCs directional migration and osteogenic differentiation.",
    "journal": "Carbohydrate polymers",
    "authors": "Zhang, Yao, Yan",
    "abstract": "Natural trabecular bone is typically a complex 3D honeycomb-like material, which can influence the behavior of bone marrow mesenchymal stem cells (BMSCs), particularly their migration and differentiation direction. However, engineering such biomimetic hydrogels with an orthogonal anisotropic structure similar with trabecular bone via a universal and scalable manner still poses a great challenge. This study develops a cellulose nanofiber (CNF) reinforced composite hydrogel with an orthogonal anisotropic structure, which exhibits a highly aligned fibrous configuration and structural densification, endowing it with excellent mechanical properties and damage-tolerant architectures. Moreover, compared with the composite hydrogel with uniaxially anisotropic structure, this as-developed composite hydrogel with orthogonal anisotropic structure utilizes the interactions between rigid and flexible components to form an anisotropic network structure in orthogonal directions, mimicking the microscopic interactions between collagen fibers and proteoglycans in natural ECMs. It could not only facilitate the physical alignment and directional migration of BMSCs, but also enhance their proliferation and differentiation into osteoblasts. Overall, replicating the structure and properties of natural trabecular bone enhances insights into cellular mechanisms, but also improves the efficiency of bone regenerative medicine treatments.",
    "score": 30,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41679864/",
    "date": "2026-02-14",
    "analysis": "{\n    \"chinese_summary\": \"本研究开发了一种具有正交各向异性结构的纤维素纳米纤维增强复合水凝胶，其高度排列的纤维结构和致密化赋予其优异的力学性能和损伤容限。该结构模拟了天然骨小梁的微观相互作用，不仅能促进骨髓间充质干细胞的定向迁移，还能增强其增殖和向成骨细胞的分化，为骨再生医学提供了新策略。\",\n    \"innovation\": \"通过刚性-柔性组分相互作用构建正交各向异性网络结构，首次模拟了天然骨小梁中胶原纤维与蛋白聚糖的微观相互作用，实现了对骨髓间充质干细胞定向迁移和分化的有效调控。\",\n    \"flaw\": \"研究未明确说明该水凝胶的长期生物相容性、体内降解性能及大规模制备的工艺稳定性，这些因素可能限制其临床转化应用。\"\n}"
  },
  {
    "id": "10.1016/j.carbpol.2026.124950",
    "title": "Bioinspired bioactive bilayer membrane: A biodegradable adhesive membrane integrating hemostasis, antibacterial, and anti-adhesion functions for visceral repair.",
    "journal": "Carbohydrate polymers",
    "authors": "Zhang, Jiang, Ma",
    "abstract": "Current soft tissue repair membranes have insufficient wet adhesion, postoperative adhesion risk, and limited therapeutic functionality. Therefore, we adopted a multiscale biomimetic design using mussel adhesion chemistry and the interfacial robustness of 3,4,5-trihydroxyphenylalanine (TOPA) in the tunicate epidermis to construct a biodegradable bilayer hydrogel membrane (PLCL-CSs@PADT). This design enables interfacial water displacement, robust tissue adhesion (21 kPa strength, 110 J m<sup>-2</sup> fracture energy), antibacterial hemostasis (>80%), and a topological hydrophobic barrier for adhesion prevention. Methacrylated gelatin is introduced as a photocurable interfacial bridging phase, achieving seamless mechanical continuity, while gradient cyclic elution eliminates residual monomers. The membrane rapidly achieved hemostasis in rat hepatic hemorrhage models (<20 s) and reduced blood loss by 83%. In postoperative abdominal adhesion models, the material completely prevented adhesion formation, attributed to the combined shielding effect of the outer layer and regulation of t-PA/PAI-1 expression. In vitro experiments demonstrated that the membrane exhibits a preliminary trend of controlled biodegradation over an 8-week period, aligning with typical soft-tissue healing timelines. This work establishes a multifunctional, bioinspired platform that combines instant tissue sealing, infectious risk mitigation, and sustained anti-adhesion performance and contributes to the development of next-generation intelligent bioactive membranes for complex soft-tissue repair.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41679854/",
    "date": "2026-02-14",
    "analysis": "{\n    \"chinese_summary\": \"本研究采用贻贝粘附化学和被囊动物表皮中3,4,5-三羟基苯丙氨酸(TOPA)的界面稳定性，构建了可降解双层水凝胶膜(PLCL-CSs@PADT)。该膜具有界面水置换、强组织粘附(21 kPa强度，110 J·m⁻²断裂能)、抗菌止血(>80%)和拓扑疏水屏障防粘连功能。在大鼠肝出血模型中实现快速止血(<20秒)并减少83%失血，在术后腹腔粘连模型中完全防止粘连形成，体外实验显示8周内可控降解趋势。\",\n    \"innovation\": \"通过多尺度仿生设计结合贻贝粘附化学和被囊动物TOPA界面稳定性，首次构建了兼具即时组织封闭、感染风险缓解和持续防粘连功能的多功能双层水凝胶膜。\",\n    \"flaw\": \"研究仅进行了8周的体外降解实验和大鼠模型验证，缺乏长期体内安全性和临床转化潜力的系统评估。\"\n}"
  },
  {
    "id": "10.1016/j.carbpol.2026.124943",
    "title": "Orange peel-derived pectin/cellulose nanofibril hydrogel reinforced by Eu-MOF for simultaneous adsorption and detection of levofloxacin.",
    "journal": "Carbohydrate polymers",
    "authors": "Zhang, Qi, Liu",
    "abstract": "Orange peel is an abundant polysaccharide-rich agro-industrial residue that is often discarded, causing resource loss and environmental burden. Here, we valorize orange peel-derived pectin into a mechanically robust and photostable fluorescent hydrogel (EuCPH) by embedding uniformly dispersed Europium-based metal-organic framework decorated cellulose nanofibril (Eu-MOF@CNF). The resulting red-emissive EuCPH enables simultaneous levofloxacin (LEV) capture and fluorescence sensing. EuCPH-4 exhibits an ultrahigh Langmuir capacity of 1388.6 mg g<sup>-1</sup> and a low limit of detection (LOD) of 0.12 μg L<sup>-1</sup>. Adsorption follows the Langmuir isotherm and pseudo-second-order kinetics, consistent with chemisorption-dominated uptake. EuCPH-4 retains 83.8% of its capacity after five cycles with negligible Eu leaching (<8 ppb) and sustains stable performance over ten fixed-bed regeneration cycles. With low-cost orange peel-derived pectin and wood-derived CNF, EuCPH can be produced at ~0.02 CNY g<sup>-1</sup>, providing a scalable and economically viable hydrogel platform for antibiotic monitoring and remediation.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41679848/",
    "date": "2026-02-14",
    "analysis": "{\n    \"chinese_summary\": \"本研究将废弃的橙皮果胶与铕基金属有机框架修饰的纤维素纳米纤维复合，制备出机械强度高、光稳定性好的红色荧光水凝胶（EuCPH）。该水凝胶能同时高效吸附左氧氟沙星（吸附容量达1388.6 mg/g）并进行荧光检测（检测限0.12 μg/L），吸附过程符合化学吸附机制。经过5次循环后仍保持83.8%的吸附容量，铕浸出量极低（<8 ppb），且成本仅约0.02元/克，为抗生素监测与治理提供了经济可行的解决方案。\",\n    \"innovation\": \"首次将橙皮果胶与铕基金属有机框架修饰的纤维素纳米纤维复合，开发出兼具高效抗生素吸附和荧光检测双功能的水凝胶材料。\",\n    \"flaw\": \"研究未在实际废水环境中验证材料的长期稳定性及复杂基质干扰下的性能表现。\"\n}"
  },
  {
    "id": "10.1016/j.carbpol.2026.124942",
    "title": "Multifunctional conductive hydrogel based on carboxymethyl cellulose/oxidized sodium alginate for machine learning-guided sports training.",
    "journal": "Carbohydrate polymers",
    "authors": "Li, Ge, Li",
    "abstract": "Multifunctional hydrogels have shown great promise in advanced wearable sensing technologies; however, their performance under real-world sweaty and dynamic conditions remains a significant challenge. In this study, a highly conductive and adhesive hydrogel was developed using poly(AM-co-AA), carboxymethyl cellulose (CMC), oxidized sodium alginate (OSA), and polydopamine-modified carbon nanotubes (PDA-CNT). Featuring a dual dynamic cross-linking system based on reversible Schiff base bonds and strong hydrogen bonding, the hydrogel demonstrates high mechanical toughness (2416 kJ/m<sup>3</sup>), excellent stretchability (1829%), and stable electrical conductivity (1.5 S/m). It exhibits outstanding sweat resistance, maintaining strong adhesion and reliable sensing performance even during intense physical activities, along with high fatigue resistance over 10,000 deformation cycles, enabling long-term reliable monitoring. As a highly sensitive strain sensor, it offers multi-range gauge factors (up to 2.53) and accurately captures human motion and physiological signals without interference from sweat or motion artifacts. When integrated with machine learning algorithms, the sensor achieves a validation accuracy of 98.75%, providing real-time feedback on movement techniques and supporting personalized training optimization. Furthermore, the hydrogel demonstrates significant antibacterial properties and good biocompatibility, making it an ideal candidate for next-generation wearable electronic devices suited for long-term athletic training and high-sweat environments.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41679847/",
    "date": "2026-02-14",
    "analysis": "{\n    \"chinese_summary\": \"本研究开发了一种基于聚(AM-co-AA)、羧甲基纤维素、氧化海藻酸钠和聚多巴胺改性碳纳米管的高导电粘附水凝胶。该水凝胶通过席夫碱键和氢键双重动态交联，具有高机械韧性(2416 kJ/m³)、优异拉伸性(1829%)和稳定导电性(1.5 S/m)，在出汗和动态条件下保持良好粘附与传感性能，经10000次变形循环仍保持高疲劳抗性。作为应变传感器，其多范围应变系数达2.53，能准确监测人体运动和生理信号，结合机器学习算法验证准确率达98.75%，同时具备抗菌性和生物相容性，适用于长期运动训练和高汗环境下的可穿戴设备。\",\n    \"innovation\": \"开发了基于双重动态交联系统（可逆席夫碱键和强氢键）的高性能水凝胶，在真实出汗和动态条件下实现了稳定的导电性、强粘附性和可靠传感性能。\",\n    \"flaw\": \"研究未明确说明该水凝胶在极端温度或长期紫外线照射等更复杂环境条件下的性能稳定性。\"\n}"
  },
  {
    "id": "10.1016/j.carbpol.2026.124924",
    "title": "Stage-specific ion release from dual-crosslinked alginate/boron-doped bioactive glass hydrogel accelerates infected wound healing.",
    "journal": "Carbohydrate polymers",
    "authors": "Song, Jiang, Ye",
    "abstract": "In wound management, achieving rapid hemostasis while maintaining excellent biocompatibility, effectively preventing bacterial infection, and promoting tissue regeneration remains a major clinical challenge. In this study, we developed a multifunctional hydrogel (TA@SA/BG/Ca<sup>2+</sup>) based on a sodium alginate (SA)/tannic acid (TA)/Ca<sup>2+</sup> dual crosslinking system uniformly loaded with boron-containing bioactive glass (BG). The hydrogel was constructed through synergistic TA@SA interactions combined with Ca<sup>2+</sup> mediated ionic crosslinking to form a stable three-dimensional network, endowing the material with strong adhesion, enhanced mechanical properties, and integrated rapid hemostatic, broad-spectrum antibacterial, and antioxidant capabilities. Benefiting from its high-water content and superior swelling capacity, the hydrogel provides a favorable microenvironment for gradual BGs degradation, enabling sustained release of bioactive ions such as B<sup>3+</sup>, Si<sup>4+</sup>, and Ca<sup>2+</sup>. These ions synergistically suppress bacterial growth and inflammation while stimulating angiogenesis, collagen deposition, and tissue regeneration. In vivo experiments demonstrated that the hydrogel significantly accelerated wound closure in both full-thickness acute wounds and infected chronic wounds. This multifunctional hydrogel, integrating hemostatic, antibacterial, antioxidant, and pro-regenerative properties, shows promise for acute and chronic wound healing and provides a basis for further evaluation toward clinical translation.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41679842/",
    "date": "2026-02-14",
    "analysis": "{\n    \"chinese_summary\": \"本研究开发了一种基于海藻酸钠/单宁酸/钙离子双交联系统的多功能水凝胶（TA@SA/BG/Ca²⁺），均匀负载含硼生物活性玻璃。该水凝胶通过协同交联形成稳定三维网络，具备强粘附性、增强机械性能，并整合了快速止血、广谱抗菌和抗氧化功能。得益于高含水量和优异溶胀能力，水凝胶为生物活性玻璃降解提供有利微环境，持续释放B³⁺、Si⁴⁺、Ca²⁺等离子，协同抑制细菌生长和炎症，同时促进血管生成、胶原沉积和组织再生。体内实验表明，该水凝胶能显著加速急性全层伤口和感染性慢性伤口的愈合。\",\n    \"innovation\": \"开发了基于海藻酸钠/单宁酸/钙离子双交联系统并负载含硼生物活性玻璃的多功能水凝胶，首次将快速止血、广谱抗菌、抗氧化和组织再生促进功能集成于单一材料。\",\n    \"flaw\": \"研究未涉及水凝胶在临床大规模应用中的长期生物安全性评估及可能存在的免疫原性风险。\"\n}"
  },
  {
    "id": "10.1016/j.carbpol.2026.124923",
    "title": "Injectable curdlan-derived hydrogel with differential release of copper and zinc ions for synergistic therapy of infected wounds.",
    "journal": "Carbohydrate polymers",
    "authors": "Wang, Ding, Liu",
    "abstract": "The engineering of multifunctional injectable hydrogels that dynamically address phase-specific requirements during infected wound healing represents a pivotal challenge in advanced wound care. Here, a series of carboxymethyl-modified curdlan (CRc)-based hydrogels were developed via multiple physical interactions with divalent metal ions. Specifically, the carboxyl groups on the CRc molecular chains formed dynamic bonds with Cu<sup>2+</sup>, Zn<sup>2+</sup>, and Ca<sup>2+</sup>, effectively facilitating hydrogel formation. These composite systems demonstrated rapid gelation (within 2 min), outstanding injectability, good self-healing ability, suitable tissue adhesion properties, and distinct release behaviors of various ions. In vitro experiments demonstrated that the Cu/Zn@CRc system exhibited dual-phase therapeutic efficacy: the initial rapid release of Cu<sup>2+</sup> achieved potent antibacterial and biofilm-disruption capabilities while also promoting macrophage recruitment and enhancing microbial clearance. Subsequent sustained Zn<sup>2+</sup> release orchestrated anti-inflammatory responses, efferocytosis potentiation, and macrophage polarization toward regenerative phenotypes. In staphylococcus aureus - infected acute and diabetic wound models, Cu/Zn@CRc hydrogel accelerated infection control while synchronously mitigating inflammation and promoting tissue regeneration through demand-driven ion delivery. Histological analyses confirmed enhanced collagen deposition and neovascularization. In conclusion, this study not only developed a novel CRc-based hydrogel carrier system for treating infectious wounds but also established a simple and efficient manufacturing procedure for CRc composite hydrogels.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41679841/",
    "date": "2026-02-14",
    "analysis": "{\n    \"chinese_summary\": \"本研究开发了基于羧甲基改性可得兰（CRc）的多功能可注射水凝胶，通过与二价金属离子（Cu²⁺、Zn²⁺、Ca²⁺）形成动态键实现快速凝胶化。Cu/Zn@CRc系统在感染伤口模型中展现出双相治疗功效：初期快速释放Cu²⁺发挥抗菌作用并促进巨噬细胞招募，后续持续释放Zn²⁺调控抗炎反应并促进组织再生，实现了按需离子递送的治疗策略。\",\n    \"innovation\": \"开发了基于羧甲基可得兰的动态可注射水凝胶系统，通过Cu²⁺/Zn²⁺的时序释放机制实现了感染伤口愈合过程中抗菌、抗炎和组织再生的多阶段协同治疗。\",\n    \"flaw\": \"研究未涉及长期生物安全性评估（如金属离子蓄积毒性）及大规模生产工艺验证。\"\n}"
  },
  {
    "id": "10.1016/j.carbpol.2026.124920",
    "title": "Light-driven switchable polyacrylamide/chitosan-based hydrogel dressings for outdoor wound temperature regulation and enhanced skin regeneration.",
    "journal": "Carbohydrate polymers",
    "authors": "Lu, Wang, Sun",
    "abstract": "Proper temperature management has been acknowledged for wound repair, but skin wounds exposed to the outdoors are inevitably susceptible to intense solar radiation and extreme temperatures. However, the wound thermal environment is easily disrupted even treated by the functional dressings with limited thermal adaptability, gradually hindering the process of wound healing. Herein, we propose an outdoor light-driven dual thermal management system sequentially employing cooling and heating dressings to optimize the temperature of wounds and accelerate wound healing. The cooling dressing integrates a light porous poly(vinyl alcohol)/SiO<sub>2</sub> aerogel exhibiting high solar reflectance (≈91.5%) and strong mid-infrared emissivity (≈95.6%) with a self-adhesive, antibacterial polyacrylamide/chitosan hydrogel. It achieves substantial coupled radiative and evaporative cooling in the outdoors, lowering the rat wound temperature by approximately 6 °C under direct sunlight. Conversely, the heating dressing of polyacrylamide/chitosan/CNT-COOH hydrogel can rapidly reach ≈45 °C under near-infrared irradiation (808 nm, 0.5 W cm<sup>-2</sup>), providing mild photothermal antibacterial effects. Critically, the sequential application of cooling and heating dressings in a wound model of SD rats notably enhanced skin regeneration. This work develops a low-cost, energy-efficient approach for outdoor wound thermal environment regulation, inspiring the design of personalized healthcare devices under detrimental environmental conditions.",
    "score": 15,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41679838/",
    "date": "2026-02-14",
    "analysis": "{\n    \"chinese_summary\": \"本研究提出一种户外光驱动双热管理系统，通过依次使用冷却敷料和加热敷料来优化伤口温度并加速愈合。冷却敷料结合高太阳反射率（约91.5%）和强中红外发射率（约95.6%）的轻质多孔PVA/SiO2气凝胶与自粘抗菌PAAm/CS水凝胶，在阳光下通过辐射和蒸发耦合冷却使大鼠伤口温度降低约6°C；加热敷料采用PAAm/CS/CNT-COOH水凝胶，在近红外照射下快速升温至约45°C，提供温和光热抗菌效果。在SD大鼠伤口模型中，顺序应用这两种敷料显著促进了皮肤再生，为恶劣环境下的伤口热管理提供了一种低成本、节能的方法。\",\n    \"innovation\": \"开发了一种顺序使用冷却和加热敷料的户外光驱动双热管理系统，首次通过耦合辐射/蒸发冷却与光热加热来动态调控伤口温度环境。\",\n    \"flaw\": \"研究仅在SD大鼠模型中进行验证，缺乏人体临床试验数据来证实其安全性和实际疗效。\"\n}"
  },
  {
    "id": "10.1007/s00441-026-04053-w",
    "title": "Effects of antibiotics encapsulated in hyaluronic acid hydrogels on different osteogenic cells and bacteria.",
    "journal": "Cell and tissue research",
    "authors": "Argyrakis, Nawale, Varghese",
    "abstract": "Topical application of antibiotics in the treatment of orthopaedic implant-related infections can be achieved by using hyaluronic acid (HA)-based hydrogels as carriers. Our aim was to investigate potential toxic effects of a novel antibiotic-loaded hydrogel on osteogenic cells and its antibacterial effect against staphylococci. A covalently cross-linked hyaluronic acid (HA)-based hydrogel was loaded with increasing concentrations of cefuroxime and vancomycin and their release was examined by UV spectrometry. Primary human (HoBs), mouse (MoBs) osteoblasts, or SaoS-2 cells were either exposed to the drug-loaded hydrogel or to antibiotics alone, followed by assessment of cell metabolism and proliferation. Antibacterial effects were evaluated against Staphylococcus aureus (S. aureus) and Staphylococcus epidermidis (S. epidermidis). Increasing concentrations of antibiotics did not affect cell metabolism in any osteogenic cell type, whereas cell proliferation remained unaltered in MoBs, was significantly reduced in SaoS-2, and was stimulated in HoBs. Cultures of MoBs and HoBs tolerated higher concentrations of vancomycin than SaoS-2. Antibiotic-loaded hydrogels did not exert toxic effects on HoBs. After 24 h, 16.8% of vancomycin and 70.8% of cefuroxime were released from the hydrogel. Cefuroxime-loaded hydrogels significantly inhibited growth of S. aureus but not of S. epidermidis, while vancomycin-loaded hydrogel had scarce effects on S. epidermidis. Loading HA-based hydrogel with antibiotics does not harm osteoblasts at clinically relevant concentrations but inhibits bacterial growth. Higher loading of vancomycin may be required due to its slow release while cefuroxime is released more rapidly. A resorbable, antibiotic-loaded hydrogel may be used for implant-related infections in orthopaedics.",
    "score": 15,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41670756/",
    "date": "2026-02-12",
    "analysis": "{\n    \"chinese_summary\": \"本研究探讨了以透明质酸（HA）水凝胶为载体负载抗生素（头孢呋辛和万古霉素）治疗骨科植入物相关感染的效果。实验表明，在临床相关浓度下，抗生素负载水凝胶对成骨细胞无毒性，并能抑制金黄色葡萄球菌生长。万古霉素释放较慢，可能需要更高负载量，而头孢呋辛释放更快。该可吸收水凝胶有望用于骨科植入物感染治疗。\",\n    \"innovation\": \"开发了一种共价交联的透明质酸水凝胶作为抗生素载体，用于局部治疗骨科植入物感染，并评估了其对成骨细胞的生物相容性和抗菌效果。\",\n    \"flaw\": \"万古霉素负载水凝胶对表皮葡萄球菌的抗菌效果有限，且万古霉素释放缓慢，可能需要更高负载量才能达到理想疗效。\"\n}"
  },
  {
    "id": "10.1002/mabi.202500493",
    "title": "Self-Assembled Peptide Hydrogels with Cell Attachment Motifs for 3D Lung Cancer Model: Evaluation of Cell-Matrix Interactions and Drug Response.",
    "journal": "Macromolecular bioscience",
    "authors": "Sırma Tarım, Tamburacı, Top",
    "abstract": "3D cancer models can mimic the tumor microenvironment, serving as a physiologically relevant platform to investigate the behavior of tumors and test anticancer therapeutics. Although bioactive peptide hydrogels have been widely evaluated for tissue engineering applications, their potential in 3D cancer models has been confirmed in only a few studies. In this study, self-assembling peptide hydrogels containing LDV (IBP1) and LDV and IKVAV cell attachment motifs (IBP2), and the control hydrogel without adhesion units (KLEI) were used for lung cancer modeling. The peptides self-assembled into hydrogels in a cell culture medium with storage moduli of ∼700-1500 Pa. The IBP1 and IBP2 hydrogels enhanced A549 cell proliferation and induced the formation of spheroids with average diameters between ∼70 and ∼150 µm. The cells in KLEI hydrogel with the highest stiffness exhibited mesenchymal-type migration, independent of the cell population, whereas transformation to mesenchymal migration necessitated a specific cell population in the IBP2 hydrogel. The cells in the IBP1 and IBP2 hydrogels with enhanced cell-cell interactions demonstrated higher resistance to docetaxel (DTX). Thus, our results indicate that these bioactive hydrogels can serve as a promising platform for in vitro assessment of cancer mechanisms and drug screening.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41663903/",
    "date": "2026-02-11",
    "analysis": "{\n    \"chinese_summary\": \"本研究利用含有LDV（IBP1）及LDV与IKVAV细胞黏附基序（IBP2）的自组装肽水凝胶构建肺癌三维模型，发现IBP1和IBP2水凝胶能促进A549细胞增殖并形成70-150微米球体，增强细胞间相互作用的细胞对多西他赛耐药性更高，表明该生物活性水凝胶可作为评估癌症机制和药物筛选的潜力平台。\",\n    \"innovation\": \"首次系统验证含特定细胞黏附基序的自组装肽水凝胶在肺癌三维模型中调控细胞行为（如增殖、迁移模式、药物耐药性）的能力。\",\n    \"flaw\": \"研究仅针对A549肺癌细胞系，未验证其他癌症类型或原代细胞，且水凝胶力学性能范围（700-1500 Pa）的生物学影响需进一步探索。\"\n}"
  },
  {
    "id": "10.1002/mabi.202500541",
    "title": "Experimental and Finite Element Analysis of a Residual Hair Keratin-based Hydrogel with Calcium for Atorvastatin Sequestration, Release, and In Vitro Activity.",
    "journal": "Macromolecular bioscience",
    "authors": "Carroll, Tarabokija, Chaudhry",
    "abstract": "Excessive fibrosis impairs tissue regeneration by promoting extracellular matrix deposition and fibroblast activation. This study introduces keratin-based hydrogels (KRT) derived from residual human hair as sustainable carriers for localized atorvastatin (Ator) delivery. Calcium incorporation (CKRT) enhanced electrostatic interactions with Ator, improving sequestration and modulating release kinetics. Comprehensive characterization of KRT included chemical composition (FTIR, DSC), charge properties (pI = 5.5; net negative charge = -15.43 µmol/g), porosity (89%), and rheology (shear-thinning, linear viscoelastic region up to 24.5% strain, thermal stability to 68°C). Ator release followed Korsmeyer-Peppas kinetics (r<sup>2</sup> > 95%), and finite element analysis validated experimental profiles (r<sup>2</sup> = 82%-95%) while estimating diffusivity reductions from 569 to 0.06 µm<sup>2</sup>/s within the gel matrix. In vitro assays confirmed CKRT biocompatibility (ISO 10993-5) and preserved Ator bioactivity, with EC<sub>50</sub> values of 208 µm for mesenchymal stem and 389 µm for fibroblast cell lines. These findings demonstrate that CKRT provides a robust platform for controlled anti-fibrotic drug delivery, supported by extensive physicochemical and mechanical characterization.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41663901/",
    "date": "2026-02-11",
    "analysis": "{\n    \"chinese_summary\": \"本研究开发了一种源自人发残留物的角蛋白水凝胶（KRT），通过掺入钙（CKRT）增强静电相互作用，作为阿托伐他汀（Ator）的局部递送载体，用于抗纤维化治疗。CKRT具有优异的理化特性（如负电荷、高孔隙率、剪切稀化），能控制药物释放并保持生物活性，体外实验证实其生物相容性和有效性，为可控药物递送提供了可持续平台。\",\n    \"innovation\": \"首次利用人发角蛋白水凝胶结合钙修饰，实现阿托伐他汀的局部可控递送，为抗纤维化治疗提供了一种可持续且高效的载体系统。\",\n    \"flaw\": \"研究主要基于体外实验，缺乏体内或临床数据验证其在复杂生物环境中的实际疗效和安全性。\"\n}"
  },
  {
    "id": "10.1002/mabi.202500581",
    "title": "Development of Emodin Nanocrystal-Loaded Hydrogel Patch for Rapid Wound Repair.",
    "journal": "Macromolecular bioscience",
    "authors": "Yenurkar, Shrivastava, Mandal",
    "abstract": "Wound healing is a complex and dynamic biological process involving multiple phases, including inflammation, proliferation, and tissue remodeling. Despite significant advances in therapeutic approaches, conventional wound healing treatments often suffer from limitations such as poor bioavailability of drugs, inadequate moisture retention, uncontrolled release profiles, and delayed tissue regeneration. To overcome these challenges, drug-loaded nanocrystals were incorporated into an alginate-based hydrogel matrix to develop a biocompatible and sustained-release wound dressing. Emodin, a natural anthraquinone compound with potent anti-inflammatory, antioxidant, and antimicrobial properties, was used as the therapeutic agent. The combination of emodin nanocrystals with the alginate hydrogel resulted in a synergistic effect, providing enhanced drug stability, controlled release, and accelerated tissue regeneration. The developed NCs-hydrogel composite demonstrates significant potential as an advanced wound dressing material, offering an effective and biocompatible platform for promoting rapid wound healing.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41655269/",
    "date": "2026-02-10",
    "analysis": "{\n    \"chinese_summary\": \"伤口愈合是一个涉及炎症、增殖和组织重塑的多阶段复杂过程。传统疗法存在药物生物利用度低、保湿不足、释放不可控和组织再生延迟等局限。本研究将负载药物的纳米晶体嵌入海藻酸盐水凝胶基质，开发了一种生物相容性缓释伤口敷料。以具有抗炎、抗氧化和抗菌特性的天然蒽醌化合物大黄素为治疗剂，其纳米晶体与水凝胶结合产生协同效应，增强了药物稳定性、实现了可控释放并加速了组织再生。该纳米晶体-水凝胶复合材料展现出作为先进伤口敷料的潜力。\",\n    \"innovation\": \"将大黄素纳米晶体与海藻酸盐水凝胶结合，开发出具有协同效应、能增强药物稳定性、实现可控释放并加速组织再生的新型伤口敷料。\",\n    \"flaw\": \"研究未涉及该复合材料在临床实际应用中的长期安全性评估和大规模生产可行性验证。\"\n}"
  },
  {
    "id": "10.1007/s10856-025-06931-1",
    "title": "Exosome-loaded hydrogel systems for spinal cord injury repair: mechanisms, advancements, and future directions.",
    "journal": "Journal of materials science. Materials in medicine",
    "authors": "Wu, Zhu, Meng",
    "abstract": "Despite ongoing research efforts, spinal cord injury (SCI) remains one of the most disabling neurological disorders where current therapies provide limited solutions that mostly address symptoms rather than true regeneration. The latest research indicates that exosome-loaded hydrogel systems could function as a dual-purpose treatment for spinal cord injury in regenerative medicine. Exosomes are tiny membrane-enclosed extracellular vesicles that carry multiple therapeutic biomolecules which help control inflammation while delivering neuroprotective and tissue regenerative properties. The structural support and controlled release capabilities of hydrogels allow them to encapsulate exosomes which leads to their stable and bioactive delivery to the injury site. This study evaluates recent progress in exosome-loaded hydrogel technology for spinal cord injury repair by examining SCI mechanisms and the advantages of combining exosomes with hydrogels to develop optimized delivery systems. Our discussion will cover both the challenges of standardizing exosome production and hydrogel formulation as well as the scalability of these systems for in vivo applications. The following review will provide a summary of this novel SCI treatment approach and set out research directions to develop a therapy that is efficient, scalable, and translatable to humans.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41636885/",
    "date": "2026-02-10",
    "analysis": "{\n    \"chinese_summary\": \"脊髓损伤（SCI）是一种致残性神经系统疾病，现有疗法主要缓解症状而非真正再生。最新研究表明，负载外泌体的水凝胶系统可作为双重用途的治疗方法。外泌体是携带多种治疗性生物分子的细胞外囊泡，具有抗炎、神经保护和促进组织再生的特性。水凝胶提供结构支撑和控释能力，能稳定递送外泌体至损伤部位。本文综述了该技术的最新进展、优势、挑战（如标准化和规模化生产）及未来研究方向。\",\n    \"innovation\": \"提出将外泌体与水凝胶结合，形成兼具生物活性递送和结构支撑的双功能系统，为脊髓损伤修复提供新策略。\",\n    \"flaw\": \"外泌体生产和水凝胶配方的标准化尚未解决，且系统规模化应用于体内仍面临挑战。\"\n}"
  }
]