[
  {
    "id": "10.1002/mabi.202500581",
    "title": "Development of Emodin Nanocrystal-Loaded Hydrogel Patch for Rapid Wound Repair.",
    "journal": "Macromolecular bioscience",
    "authors": "Yenurkar, Shrivastava, Mandal et al.",
    "abstract": "Wound healing is a complex and dynamic biological process involving multiple phases, including inflammation, proliferation, and tissue remodeling. Despite significant advances in therapeutic approaches, conventional wound healing treatments often suffer from limitations such as poor bioavailability of drugs, inadequate moisture retention, uncontrolled release profiles, and delayed tissue regeneration. To overcome these challenges, drug-loaded nanocrystals were incorporated into an alginate-based hydrogel matrix to develop a biocompatible and sustained-release wound dressing. Emodin, a natural anthraquinone compound with potent anti-inflammatory, antioxidant, and antimicrobial properties, was used as the therapeutic agent. The combination of emodin nanocrystals with the alginate hydrogel resulted in a synergistic effect, providing enhanced drug stability, controlled release, and accelerated tissue regeneration. The developed NCs-hydrogel composite demonstrates significant potential as an advanced wound dressing material, offering an effective and biocompatible platform for promoting rapid wound healing.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41655269/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1007/s10856-025-06931-1",
    "title": "Exosome-loaded hydrogel systems for spinal cord injury repair: mechanisms, advancements, and future directions.",
    "journal": "Journal of materials science. Materials in medicine",
    "authors": "Wu, Zhu, Meng et al.",
    "abstract": "Despite ongoing research efforts, spinal cord injury (SCI) remains one of the most disabling neurological disorders where current therapies provide limited solutions that mostly address symptoms rather than true regeneration. The latest research indicates that exosome-loaded hydrogel systems could function as a dual-purpose treatment for spinal cord injury in regenerative medicine. Exosomes are tiny membrane-enclosed extracellular vesicles that carry multiple therapeutic biomolecules which help control inflammation while delivering neuroprotective and tissue regenerative properties. The structural support and controlled release capabilities of hydrogels allow them to encapsulate exosomes which leads to their stable and bioactive delivery to the injury site. This study evaluates recent progress in exosome-loaded hydrogel technology for spinal cord injury repair by examining SCI mechanisms and the advantages of combining exosomes with hydrogels to develop optimized delivery systems. Our discussion will cover both the challenges of standardizing exosome production and hydrogel formulation as well as the scalability of these systems for in vivo applications. The following review will provide a summary of this novel SCI treatment approach and set out research directions to develop a therapy that is efficient, scalable, and translatable to humans.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41636885/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1002/mabi.202500400",
    "title": "Dynamic Gelatin Hydrogels Crosslinked by Dithiolane-Norbornene Click Chemistry.",
    "journal": "Macromolecular bioscience",
    "authors": "Afolabi, He, Lin et al.",
    "abstract": "Hydrogels prepared from gelatin are ideal for mimicking the extracellular matrix (ECM) owing to their inherent cell-adhesive and protease-labile peptide sequences. While gelatin is highly water-soluble, it does not form the triple-helical structure. As a result, physically crosslinked gelatin-based hydrogels are only stable at low temperatures, precluding their use in 3D cell culture. Gelatin-methacryloyl (GelMA) and gelatin-norbornene (GelNB) have been developed to enable the stable crosslinking of gelatin-based hydrogels via chain-growth or step-growth photopolymerization. However, most gelatin-based hydrogels lack dynamically tunable properties unless macromers with dynamically crosslinkable motifs are used. Here, we integrate GelNB with dithiolane-containing crosslinker poly(ethylene glycol)-tetra-lipoic acid (PEG4LA)-for modular photo-crosslinking of GelNB into hydrogels under cytocompatible light exposure (365 nm, 5 mW/cm<sup>2</sup>) with a low photoinitiator concentration (1 mm LAP). Even under these mild reaction conditions, the stiffness of GelNB/PEG4LA hydrogels could be dynamically tuned by inducing dithiolane ring-opening via secondary light exposure, thereby creating dynamic and cytocompatible hydrogels suitable for in situ encapsulation, culture, and differentiation of human induced pluripotent stem cells (hiPSCs).",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41634947/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1002/mabi.202500568",
    "title": "Bacteriophage and Nitric Oxide Combined Release from a Dual Hydrogel Matrix for Wound Healing Applications.",
    "journal": "Macromolecular bioscience",
    "authors": "Wilson, Goodman, Sapkota et al.",
    "abstract": "Infection sites and open wounds provide a prime environment for the growth of opportunistic pathogens, leading to persistent infections caused by bacteria that contain antimicrobial-resistant phenotypes. Mistreatment of these wound infections often increases antimicrobial resistance (AMR), thereby decreasing the effectiveness of antibiotics. With the increase in AMR, new antimicrobial therapeutics that target these hard-to-kill pathogens are needed. Herein, naturally harvested bacteriophages (ECΦ) were combined with another established antimicrobial molecule, nitric oxide (NO). This combination has rarely been explored in biomedical devices but shows excellent potential for developing broad-spectrum, antibacterial materials. Bacteriophages were encapsulated in alginate microbeads and suspended in a NO-releasing thermoresponsive hydrogel. The phages were shown to have a delayed release from the alginate beads when incorporated into the gel, compared to the release observed within 24 h in aqueous medium. This delayed release enabled tunable phage delivery by adjusting the viscosity of the bulk gel base. Additionally, we used alginate as the base for microbeads, resulting in a physiologically safe material due to its proven biocompatibility. The final ECΦ and NO-releasing bead-gel matrix demonstrated 5-10 times larger zones of bacterial killing while maintaining low cytotoxicity, enabling further development in various clinical applications, including wound healing.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41618802/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1002/mabi.202500457",
    "title": "Preparation of Photoclick-Crosslinked Modular Gelrite Hydrogel: Tuning Physico-Chemical Characteristics, Cytocompatibility, In Vitro Cefixime Trihydrate Release, and Antimicrobial Properties.",
    "journal": "Macromolecular bioscience",
    "authors": "Keerthana, Parhi, Datti et al.",
    "abstract": "The fabrication of a modular Gelrite-based covalently crosslinked hydrogelator (Gelrite-MA) by photo-initiated click chemistry to facilitate cefixime trihydrate administration is reported for the first time. Modular Gelrite is prepared via base (DIPEA)-catalyzed esterification reaction between Gelrite and maleic anhydride. Under the UV light, the modular Gelrite containing carbon-carbon double bonds undergoes a photocrosslinking reaction with 2, 2'-(Ethylenedioxy)diethanethiol and forms the hydrogelator. Comprehensive characterization of the modular Gelrite-based compound is done using various methods. The significant differences in the hydrogelator's swelling ratio at pH values of 1.2 and 6.8 demonstrate its pH-responsive behavior. The rheological analysis shows that the yield stress value of Gelrite-MA hydrogel is higher at pH 1.2 (2542 Pa) than at pH 6.8 (258 Pa). The Gelrite-MA hydrogel is cytocompatible, showing 128.8 ± 5.9% cell viability against L929 cell lines after 3 days. The Gelrite-MA hydrogel formulation demonstrates sustained release matrix characteristics, releasing 79.4±3.1% of total cefixime over 30 h. The 5 mg hydrogel-cefixime formulation effectively suppresses the inhibition of Escherichia coli and Staphylococcus aureus, with ZOI of 55.3 ± 1.5 mm and 42.0 ± 2.0 mm, respectively. The lower minimum inhibitory concentration value suggests that the hydrogel formulation is more potent against E. coli (MIC = 39 µg/mL) bacteria than S. aureus (MIC = 5 mg/mL). Therefore, the prepared cytocompatible and pH-responsive Gelrite-MA hydrogel has the potential to serve as a sustained drug delivery matrix for administering cefixime trihydrate orally.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41618795/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1016/j.carbpol.2026.124887",
    "title": "Injectable dynamic hydrogel formed with oxidized dextran and lysozyme for endometrial repair.",
    "journal": "Carbohydrate polymers",
    "authors": "Lu, Yu, Pang et al.",
    "abstract": "Endometrial injury is a significant cause of female infertility, while conventional treatments suffer from drawbacks such as venous thrombosis, carcinogenic risk, antimicrobial resistance, recurrent intrauterine adhesions (IUAs), and suboptimal therapeutic efficacy. To address these challenges, we have developed an injectable dynamic hydrogel based on oxidized dextran and lysozyme. This formulation enables minimally invasive syringe delivery to the uterine cavity, where it undergoes rapid self-crosslinking to establish a protective and therapeutic barrier. Our hydrogel exhibits tunable mechanical properties and degradation rate. Besides, it possesses intrinsic antibacterial and anti-inflammatory activities arising from the dissociated constitutive biomacromolecules. In vitro studies demonstrated the hydrogel's capacity to combat bacterial infection and modulate macrophage polarization from pro-inflammatory M1 to reparative M2 phenotype. In vivo evaluations confirmed significant promotion of endometrial regeneration by it through dual mechanisms: inhibition of pathological collagen deposition and stimulation of functional angiogenesis. This multifunctional hydrogel platform thus represents a transformative approach for endometrial repair with clinical translation potential.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41617291/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1016/j.carbpol.2025.124882",
    "title": "Self-healing quaternized chitosan-phenylboronic hydrogel with ceria nanozymes and stem-cell exosomes simultaneously eradicates MRSA biofilm and regenerates diabetic wounds.",
    "journal": "Carbohydrate polymers",
    "authors": "Xie, Jiang, Lu et al.",
    "abstract": "Diabetic wounds represent a major clinical challenge due to their susceptibility to bacterial biofilm infections, persistent oxidative stress, and impaired tissue regeneration. Current therapeutic approaches typically address these pathological factors individually, limiting their overall efficacy in achieving complete wound closure. There is thus an urgent need for integrated platforms capable of simultaneously targeting multiple barriers to healing. Here we show that a self-healing hydrogel composed of quaternized chitosan-phenylboronic acid (QCSP), ceria nanoparticles (CeNPs), and embryonic stem cell-derived exosomes (ESC-Exo) effectively eradicates methicillin-resistant Staphylococcus aureus (MRSA) biofilms, scavenges reactive oxygen species, and promotes tissue regeneration in diabetic mice. The QCSP matrix provides inherent antibacterial activity and injectable, self-healing properties, while CeNPs function as catalytic antioxidants through reversible Ce<sup>3+</sup>/Ce<sup>4+</sup> redox cycling. Incorporation of ESC-Exo further enhances angiogenesis and re-epithelialization. In an MRSA-infected diabetic wound model, this multifunctional hydrogel achieves near-complete wound closure within 12 days alongside significant biofilm clearance and collagen deposition. This work demonstrates that integrating natural polymer-based hydrogels with nanozymes and bioactive exosomes offers a promising strategy for managing complex chronic wounds.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41617289/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1016/j.carbpol.2025.124872",
    "title": "Sustainable MXene-based wearable sensor reinforced with microcrystalline cellulose for human motion monitoring in subzero environments with integrated machine learning.",
    "journal": "Carbohydrate polymers",
    "authors": "Hasan, Luo, Xu et al.",
    "abstract": "Flexible sensors encounter significant challenges in subzero temperatures, including mechanical fragility, signal instability, and environmental sustainability issues. To overcome these limitations, a novel eco-friendly hydrogel sensor has been developed by integrating guar gum, glycerol, MXene, and microcrystalline cellulose (MCC) extracted from discarded towels. The incorporation of Ti<sub>3</sub>C<sub>2</sub>Tₓ MXene nanosheets enhances sensitivity while maintaining mechanical stability and structural integrity. Glycerol functioned as a primary anti-freezing agent, successfully preventing ice crystallization and maintaining flexibility at subzero temperatures. The hydrogel exhibited excellent tensile strength (269 kPa), stretchability (580 %), electrical conductivity (1.49 mS/cm), exceptional functionality at -56 °C, self-healing, and self-adhesion capability at the optimum concentration. It also demonstrated exceptional cyclic stability (600 cycles), and precise detection of human motion. Moreover, the obtained data was processed by support vector classifier for strain prediction, achieving accuracy of 91 % and 95 % F1 Score. The 3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyltetrazoliumbromid cytotoxicity test confirmed its compatibility for human umbilical vein endothelial cells with cell viability of 79 %. Degradation analysis in pond water ensured the decomposition within 25 days. This work introduces a novel biodegradable sensor with sustainable approach for developing wearable electronics that can operate in extreme environmental conditions including aerospace and arctic exploration.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41617285/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1016/j.carbpol.2025.124869",
    "title": "Current trend on preparation, properties, and wound healing applications of polysaccharide-based hydrogel patches: A review.",
    "journal": "Carbohydrate polymers",
    "authors": "Tan, Dong, Zhang et al.",
    "abstract": "Wound management is a major global challenge, which has a significant negative impact on the medical system and the social economy. Nevertheless, traditional wound treatment strategies have limitations in precise wound management and dynamic drug release, which in turn leads to poor wound healing. Notably, increasing studies are focusing on developing hydrogel patches that can respond in real time to the microenvironment of wounds. In recent years, numerous studies have adopted polysaccharides (chitosan, hyaluronic acid, alginate, cellulose, etc.) as carrier materials to prepare hydrogel patches. Polysaccharide hydrogel patches (PHPs) possess excellent biocompatibility, tunable biodegradability, proficient swelling and moisturizing properties, and good mechanical properties. Currently, PHPs are usually prepared by methods including molding, electrospinning, freeze-drying, and 3D printing. In-depth exploration of the functional properties of PHPs and their application in wound environment monitoring and response holds significant guiding importance for the design of PHPs with specific functionalities. Hence, this paper systematically outlines the carrier materials and preparation methods of PHPs. Moreover, this article comprehensively reviews the functional properties of PHPs. Furthermore, this review systematically introduces the response mechanisms of PHPs to critical stimulating factors in the wound microenvironment (temperature, humidity, pH, glucose, ROS, etc.) and their application progress.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41617282/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1016/j.carbpol.2025.124865",
    "title": "Bioinspired nanocellulose-based ultrathin hydrogel bioadhesives with sweat-resistant properties.",
    "journal": "Carbohydrate polymers",
    "authors": "Feng, Shen, Zhang et al.",
    "abstract": "Hydrogels have gained prominence as a distinctive material for smart healthcare devices and wearable electronics, owing to their inherent biocompatibility, tissue-like mechanical properties and superior water and oxygen permeability. In most application scenarios, hydrogels are required to have certain adhesion properties. However, current hydrogel adhesive systems are fundamentally constrained by two intrinsic material restrictions: low mechanical strength, and compromised adhesion in humid environments (under conditions such as sweating and bleeding), which severely restrict their practical applications. Inspired by the covalent and physical synergistic adhesion strategy of mussels and the interfacial water-capturing mechanism of spiderwebs, we designed and fabricated an ultrathin poly (acrylic acid) (PAA)/N-hydroxysuccinimide (NHS)/cellulose nanocrystal (CNC) composite hydrogel (PNCGels) tape. This PNCGels tape adopts a dry crosslinking mode, which enables the carboxyl groups in the hydrogel rapidly form physical interactions such as hydrogen bonds with tissue surface within less than 5 s. Subsequently, the NHS ester groups grafted onto PAA couple covalently with primary amine groups in the tissue. Additionally, the CNC nanofillers enhance cohesive strength by reconstructing a dynamic hydrogen-bonding network to balance adhesion, which ensures stable adhesion even in the presence of sweat. The resultant PNCGels tape displayed remarkable wearability (thickness of only 250 μm), excellent adhesive properties (adhesion strength: 128 kPa), good mechanical performance (tensile strength: 1400 kPa). The integrated features of ultra-slimness, high toughness, and humidity-resistant adhesion provide a transformative platform for advanced applications, including smart wound dressings (hemostasis, on-demand removal) and motion sensing technologies.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41617280/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1016/j.carbpol.2025.124861",
    "title": "Strong and tough liquid crystal hydrogels from chitin whiskers with multiscale dynamic bonds guide osteogenic differentiation.",
    "journal": "Carbohydrate polymers",
    "authors": "Wen, Li, Huang et al.",
    "abstract": "Liquid crystal (LC) state and viscoelasticity with rapid stress relaxation of osteoid are crucial for cell behavior regulation, but mimicking these features in bone repair materials through a facile approach is challenging. Here, harnessing the innate LC characteristic and nanoscale rigidity of chitin whiskers (CHWs), we develop novel CHWs/polyvinyl alcohol (CHWs/PVA) LC hydrogels with multiple osteoid-like features through a facile dual-physical crosslinking strategy. The self-assembly of CHWs, accompanying with PVA chains, enable the hydrogels with osteoid-like LC state and viscoelasticity. Freeze-thawing-induced microcrystalline domains (sacrificial bonds) and Hofmeister-enhanced hydrogen bonds can serve as multiscale hierarchical energy dissipation motors to endow the hydrogels with rapid stress relaxation rate, as well as high and adjustable modulus. We found that YAP-dependent mechanotransduction and LC state-mediated protein clustering can synergistically boost the osteogenic differentiation of bone mesenchymal stem cells, moreover, this positive effect can be flexibly regulated by adjusting the modulus, stress relaxation and LC characteristics of the hydrogels. This study provides new insights for designing osteoid-like biomimetic materials, and further elucidates the strengthening and toughening as well as osteogenic differentiation mechanisms.",
    "score": 30,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41617277/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1016/j.carbpol.2025.124835",
    "title": "Synergistic promotion of diabetic wound healing by glucose-responsive functional chitosan-based composite nanohydrogels.",
    "journal": "Carbohydrate polymers",
    "authors": "Yang, Sun, Peng et al.",
    "abstract": "The complex pathological microenvironment, characterized by hyperglycemia, chronic inflammation, and infection, significantly impedes diabetic wound healing. Multi-strategy collaboration is expected to improve the complex pathological microenvironment and accelerate diabetic wound healing. This work developed a dynamic borate bond-crosslinked chitosan/polyvinyl alcohol nanohydrogel loaded with glucose oxidase (GOx) and ZnS/Arg@MOF-818 nanoparticles for synergistic therapy via glucose depletion, photothermy, nitric oxide (NO), and hydrogen sulfide (H₂S)-mediated gas therapy. GOx enables glucose depletion, lowering local pH and triggering the on-demand release of ZnS/Arg@MOF-818 nanoparticles, which exhibited a photothermal conversion efficiency of 55 % and outstanding photothermal stability in vitro. The composite nanohydrogel Gel/ZnS/Arg@MOF-818 enabled sustained and stable release of NO/H<sub>2</sub>S with glucose existent. The synergistic effects of glucose depletion, photothermy, and controlled NO/H₂S release effectively disrupted biofilms, eradicated multidrug-resistant pathogens, reduced inflammation, and promoted angiogenesis. The composite nanohydrogel exhibited 100 % antibacterial efficacy against drug-resistant strains of Staphylococcus aureus, Escherichia coli, and Acinetobacter baumannii in vitro. In vivo, it significantly accelerated diabetic wound healing 98 % within 9 days, accompanied by CD31/VEGF-driven neovascularization, balanced cytokine expression, and organized collagen deposition, without significant systemic toxicity. Therefore, chitosan-based hydrogels crosslinked via borate ester bonds in this study exhibit considerable potential for future clinical applications in the management of chronic wounds.",
    "score": 15,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41617272/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1016/j.carbpol.2025.124866",
    "title": "Composite cellulose-PEDOT:PSS conducting hydrogels destroy bacterial Cell wall structure for prevention of wound infection.",
    "journal": "Carbohydrate polymers",
    "authors": "Luo, Zhang, Zhang et al.",
    "abstract": "Wounds infected with Staphylococcus aureus (S.aureus) represent a significant healthcare challenge. The interaction between the bacterial cell membrane and functional groups of conductive materials induces deformation or rupture of the bacteria, thereby achieving an antibacterial effect. Conductive hydrogels mimic this phenomenon through localized current distribution, offering a promising therapeutic strategy. However, conventional conductive materials like PEDOT:PSS often suffer from phase separation in hydrogels, limiting their applications. To address these limitations, this study engineers a three-dimensional bacterial cellulose (BC) nanofiber template that utilizes hydroxy-mediated hydrogen bonding to adsorb and align PEDOT:PSS within the hydrogel matrix, forming continuous conductive pathways. The composite consists of a conductive moiety made of BC/PEDOT:PSS, which is incorporated into a hydrogel composed of polyvinyl alcohol, polyacrylic acid, and tannic acid. The resulting material achieves a conductivity of 11.1 S/cm and a tensile strain of 605.8 %, significantly surpassing existing benchmarks. The incorporation of BC greatly enhances the hydrogel's mechanical properties and conductivity, making it a promising candidate for wound healing applications.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41617266/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1016/j.carbpol.2025.124817",
    "title": "Aldehyde-mediated carboxymethylcellulose/gelatin-based injectable dual network hydrogel with antimicrobial and adhesion properties for rapid hemostasis and wound repair.",
    "journal": "Carbohydrate polymers",
    "authors": "Liu, Hu, Liang et al.",
    "abstract": "Rapid hemostasis of irregular or non-compressible wounds remains a critical challenge. Existing hemostatic agents typically lack the required adhesion, antimicrobial, and rapid hemostatic properties. In this study, an injectable dual-crosslinked hemostatic hydrogel with antibacterial and adhesive properties (DCG-EDC) was designed by carboxymethyl cellulose (CMC) and gelatin (Gel) as raw materials. CMC was oxidized to produce oxidized carboxymethyl cellulose (DCMC) with aldehyde groups. DCG-EDC hydrogel was constructed using DCMC and Gel via Schiff reaction and amide reaction, and this unique dual-network structure confers faster gelation time (8 ± 2 s), enhanced adhesion strength and superior antimicrobial performance. In vitro experiments confirmed the ability to accelerate coagulation by activating endogenous pathways. In vivo experiments showed that DCG-EDC hydrogel significantly reduced hemostasis time and blood loss in liver injury model (69.79 ± 8.33 s, 15.34 ± 2.44 mg) and tail amputation model (80.41 ± 10.34 s, 18.67 ± 2.15 mg). In addition, DCG-EDC hydrogel promotes fibroblast migration which also obviously accelerates the healing of bacterial infections. Therefore, this multifunctional dual-crosslinked DCG-EDC hydrogel holds great promise as candidate material for managing complex bleeding wounds and promoting repair.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41611431/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1016/j.carbpol.2025.124806",
    "title": "Recent developments in all-polysaccharide hydrogels: Synthesis, properties, and biomedical applications.",
    "journal": "Carbohydrate polymers",
    "authors": "Friday, Edgar et al.",
    "abstract": "Their benign nature, polyfunctionality, inherently low toxicity, biodegradability, compatibility in certain situations, and low tendency to elicit strong immune responses make all-polysaccharide hydrogels attractive biomaterials. All-polysaccharide hydrogels may also exhibit other useful properties that are beneficial for biomedical use such as injectability, self-healing, tunable mechanical properties, stimuli-responsiveness, and more importantly, the absence of toxic byproducts upon degradation. To realize this potential, researchers have functionalized polysaccharides with various moieties that enable fabrication of all-polysaccharide hydrogels crosslinked by different methods. This review discusses recent developments in all-polysaccharide hydrogels including physical and covalent crosslinking strategies, hydrogel properties, and the various ways by which these properties are tuned. Furthermore, biomedical applications of all-polysaccharide hydrogels are summarized, and we provide our future perspective.",
    "score": 15,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41611425/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1016/j.carbpol.2025.124802",
    "title": "3D printed pectin-chitosan polyelectrolyte hydrogels for controlled gastrointestinal release and colon-targeted delivery.",
    "journal": "Carbohydrate polymers",
    "authors": "Hwang, Yang, Yoon et al.",
    "abstract": "Polysaccharide-based hydrogels, including pectin (PEC) and chitosan (CS), have been utilized for oral delivery because of their high biocompatibility, low immunogenicity, and stimuli-responsiveness. However, ionically crosslinked hydrogels lack structural stiffness because of their low ionic strength in the harsh digestive environment. In this study, we developed 3D printed hydrogels through polyelectrolyte complexation and ionic gelation with two crosslinkers for adjustable mechanical strength and gastrointestinal stability. To achieve high precision dual droplet-based 3D printing, cellulose nanocrystals (CNCs) nanomaterial solutions mixed with two ionic crosslinkers were utilized as the support biomaterial ink. The PEC-CS and CNCs biomaterial inks had their rheological properties and printability optimized to fabricate freeform and hierarchical structures. Compared with PEC hydrogels, PEC-CS hydrogels exhibited enhanced mechanical strength (2.4-fold) and sustained release (2.0-fold). All hydrogels showed colon-targeted delivery and sustained release owing to the shrink in the stomach and pectinase-triggered degradation in the colon. The hydrogels with three different model drug localizations were 3D printed through variations in drug localization and surface area ratios during the printing process, demonstrating precisely controlled gastrointestinal release. This polysaccharide-based 3D printing system can be applied for personalized oral delivery of diverse biopharmaceuticals to desired locations with controlled release in the gastrointestinal tract.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41611424/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1016/j.carbpol.2025.124790",
    "title": "Repairing osteoporotic bone defects under iron overload: A chitosan-hyaluronic acid hydrogel via synergistic iron chelation and ROS responsiveness.",
    "journal": "Carbohydrate polymers",
    "authors": "Lin, He, Zhao et al.",
    "abstract": "Iron overload in the bone microenvironment elevates reactive oxygen species (ROS) and triggers osteoblast ferroptosis, exacerbating osteoporosis. We developed a genipin-crosslinked hydrogel composed of 3-aminophenylboronic acid-grafted hyaluronic acid and hydrocaffeic acid (DHCA)-grafted chitosan (CS-DHCA/HA-3-APBA) and loaded with chromium picolinate (CrPic). In the environment of osteoporosis, Fe<sup>3+</sup> coordination compacted the network and increased compressive modulus by approximately twofold, while elevated ROS accelerated network degradation, supporting ROS-responsive CrPic release, whereas under physiological buffer conditions the release remained slow and stable. In vitro, in iron-overloaded rat bone marrow mesenchymal stem cells (rBMSCs), the CS-DHCA/HA-3-APBA/CrPic hydrogel lowered ROS, preserved mitochondrial membrane potential, blocked ferroptosis, and restored migration and osteogenic differentiation. Treated cells showed alkaline phosphatase activity and mineral deposition near control levels despite iron overload. In vivo, in rabbits with iron overload-induced osteoporosis, defects treated with the Fe<sup>3+</sup>-chelating, CrPic-loaded hydrogel (F-Gel@CrPic) formed robust new bone. At 4 weeks, BV/TV in this group was about 30 %, roughly threefold higher than in untreated defects, and it nearly doubled again by 8 weeks, approaching healthy levels. New bone showed higher mineral density and markedly reduced iron deposition. This work highlights the unique ability of engineered hyaluronic acid/chitosan hydrogels to actively correct a pathological microenvironment and achieve functional tissue repair, showcasing the promise of natural polysaccharide-based engineering for advanced therapy.",
    "score": 30,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41611420/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1002/mabi.202500575",
    "title": "Biotechnological Control of Hydrogel Properties via Recombinant Protein Molecular Weight Engineering.",
    "journal": "Macromolecular bioscience",
    "authors": "Schlauch, Ebbecke, von Alwörden et al.",
    "abstract": "Hydrogels based on natural polymers are widely used in 3D cell culture and tissue engineering due to their biocompatibility and tunability. In this work, recombinant collagen-derived proteins of defined molecular weights were designed and tested as precursors for methacrylated, photocrosslinkable hydrogels. Proteins of 25.6 kDa, 58 kDa, and 89.2 kDa were recombinantly expressed in Komagataella phaffii, methacrylated, and photocrosslinked to form well-defined hydrogels. A Design of Experiments (DoE) strategy was employed to quantify the effects of degree of functionalization (DoF) and precursor molecular weight on hydrogel stiffness, deformability, and swelling. For the first time, it was reported that both the DoF and molecular weight of recombinant proteins used for hydrogel fabrication significantly influence hydrogel properties. The molecular weight effects were most pronounced at lower chain lengths. Predictive models generated from the DoE revealed non-linear and interactive contributions of both parameters, while mixed-material formulations suggested non-additive behavior beyond the fitted design space. Additionally, biocompatibility for all materials was shown by live-dead staining of cells seeded onto the crosslinked materials. The results demonstrate that recombinant protein chain length can be used as a powerful design parameter to modulate hydrogel mechanics. Such materials not only enable xeno-free cultivation but also provide a biotechnological route toward rationally engineered biomaterials for diverse applications.",
    "score": 15,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41607044/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.3390/ijms27021127",
    "title": "Cannabidiol-Loaded Mucoadhesive PLGA Nanosphere-Chitosan Hydrogel Patch for Oral Therapeutic Applications.",
    "journal": "International journal of molecular sciences",
    "authors": "Chuluunbaatar, Park, Song et al.",
    "abstract": "Cannabidiol (CBD), the primary bioactive element of cannabis, has shown promise in alleviating pain and inflammation, although mechanisms in periodontal inflammation are not fully understood. To improve its limited solubility and mucosal permeability, the developed chitosan-based mucoadhesive hydrogel incorporating CBD-loaded PLGA nanospheres (CPN hydrogel) was characterized by FT-IR, SEM, particle size, rheological, swelling, and diffusion analyses, followed by biological evaluations, including wound-healing and RT-qPCR-based anti-inflammatory assays. The improved CPN hydrogel had a homogeneous shape, better viscoelastic behavior, and sustained drug release. Over 90% of CBD was released within 96 h, and Franz cell experiments showed improved permeability (124.1 μg/cm<sup>2</sup> after 72 h). The gellan gum-based mucosal substrate significantly increased adhesion (1137.33 ± 142.25 s) compared to the control groups. Antioxidant studies indicated 73.65% DPPH radical scavenging, whereas antibacterial tests showed more than 99% suppression of <i>Staphylococcus aureus</i>. Furthermore, in vitro studies validated its wound healing and the downregulation of the inflammatory cytokines IL-6 and TNF-α. The results indicate that the CPN-loaded chitosan hydrogel has extended mucosal retention, strong antibacterial activity, and steady release of CBD. This underscores its significant potential as a targeted treatment for inflammatory oral diseases such as gingivitis and periodontitis.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41596768/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.3390/ijms27020775",
    "title": "Antitumor Evaluation of Rhenium-188 and Paclitaxel Co-Delivered via Thermosensitive Hydrogel in a Hepatocellular Carcinoma Animal Model.",
    "journal": "International journal of molecular sciences",
    "authors": "Shih, Peng, Chiang et al.",
    "abstract": "Hepatocellular carcinoma (HCC) remains one of the most common malignancies worldwide and a leading cause of cancer-related mortality. Current treatment options for advanced or unresectable HCC have limited efficacy and are often associated with systemic toxicity. In this study, a multifunctional, thermosensitive hydrogel-based delivery system was developed to enhance localized treatment of HCC. This system incorporates rhenium-188 sulfur colloid (<sup>188</sup>Re-colloid), a β-emitting radiotherapeutic agent, and paclitaxel (PTX)-loaded micelles within a biodegradable PCL-PEG-PCL hydrogel matrix. The formulation enables in situ gelation at physiological temperatures, providing sustained release and prolonged retention of therapeutic agents at the tumor site. Physicochemical characterization confirmed the structural integrity and injectability of the formulations, while in vivo biodistribution studies in a murine hepatic tumor model demonstrated enhanced intratumoral accumulation and reduced systemic dispersion. The combined chemo-radiotherapeutic platform showed potential for improved therapeutic efficacy through synergistic action, offering a promising minimally invasive strategy for treating unresectable hepatocellular carcinoma.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41596425/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1021/acsbiomaterials.5c01784",
    "title": "Mechanoresponsive Biomaterials: Principles, Mechanisms, and Applications.",
    "journal": "ACS biomaterials science & engineering",
    "authors": "Rajeev, Patil, Yadav et al.",
    "abstract": "Mechanoresponsive biomaterials are a revolutionary class of materials designed to respond dynamically to mechanical stimuli, providing tissue engineering and regenerative medicine with precise control over biological processes. Through processes including supramolecular interactions, strain stiffening, and force-induced conformational changes, these materials, which include hydrogels, elastomers, and piezoelectric composites, imitate the mechanics exclusive to biological tissues. Additionally, mechanoresponsive systems improve drug delivery by releasing drugs in response to pH changes or mechanical strain using various materials, including magnetic scaffolds and ultrasound-triggered micelles. Despite advancements in numerous arenas of biological sciences, problems with clinical translation, scalability, and long-term biocompatibility still exist. New developments combine technologies like 4D bioprinting to create dynamic, patient-specific scaffolds and artificial intelligence (AI)-assisted design to maximize material qualities. To achieve material innovation with the desired level of biological complexity, future initiatives should focus on multifunctional platforms that combine mechanical, electrical, and biochemical inputs at an advanced level. This review dives into several aspects of mechanoresponsive biomaterials by navigating through the fabrication methods, underlying principles, inception of these in biomedical applications, and progression through the current research settings.",
    "score": 15,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41589632/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  },
  {
    "id": "10.1021/acsbiomaterials.5c01970",
    "title": "Dual-Cross-Linked Self-Healing Hydrogels for 3D Cell Applications.",
    "journal": "ACS biomaterials science & engineering",
    "authors": "Schnettger, Karatas, Lüttig et al.",
    "abstract": "host-guest (βCD/adamantane) cross-linked hydrogels have received increasing attention in recent years for cell culture applications. A major challenge of these systems remains the lack of stability and mechanical integrity, which has led to the development of dual cross-linked gels mainly by combining the host-guest (βCD/adamantane) interaction with other physical cross-links based on ionic interactions or H-bonding. In this research, 11 dual-cross-linked hydrogels were produced on the basis of defined βCD/adamantane interactions in addition to covalent cross-linking with PEGDA<sub>3500</sub> of thiol-functionalized copolymers. The dual-cross-linked hydrogels exhibit high mechanical strength and improved stability compared with βCD/Ada control hydrogels. The ability to self-heal depends on the initial strength of the gels. Encapsulation of B16F1 cells in these gels showed their uniform distribution and good cytocompatibility. It is particularly noteworthy that a higher number of living B16F1 cells were found in RGD-modified gels compared with Matrigel as a control.",
    "score": 10,
    "url": "https://pubmed.ncbi.nlm.nih.gov/41589389/",
    "date": "2026-02-10",
    "is_new": true,
    "analysis": "{}"
  }
]